<?php
	$LANG = Array(
		"page_title" => "Новости",
		"page_desc" => "Раздел новостей",
		"create_news" => "Создать новость",
		"config" => "Управление",
		"func_warning_title" => "Обратите внимание!",
		"func_warning_text" => "Система находится в стадии активной разарботки. Некоторый функционал может быть реализован не полностью! В случае обнаружения ошибок незамедлительно свяжитесь с разарботчиком системы по email: <b>admin@sirkadirov.com</b>",
		"oops" => "Упс!",
		"no_news" => "Новостей ещё нет, но не огорчайтесь! Скоро они появятся! :)",
		"author_profile" => "Профиль автора",
		"pub_date" => "Дата публикации",
		"edit" => "Редактировать"
	);
?>