<?php DEFINED("SPM_GENUINE") OR DIE('403 ACCESS DENIED'); ?>
<html>
	<head>
		<title>ACCESS DENIED - SPM</title>
	</head>
	<body>
		<div align="center">
			<h1>ОШИБКА 403: ДОСТУП ЗАПРЕЩЁН!</h1>
			<p>Ваш текущий уровень доступа ниже требуемого для просмотра содержания данного файла или папки. Если вы считаете, что это ошибка - сообщите об этом администратору сайта.</p>
			<p>Также, возможен и такой случай, что вас забанили в системе. Причины бана вы можете узнать у своего учителя / куратора / системного администратора или администратора сайта.</p>
			<p>Если вы ещё не вошли в систему под своей учётной записью, не посещали недоступных для вас страниц, но видите это сообщение - возможно сайт находится на стадии обновления или реконструкции</p>
		</div>
		<hr/>
		<p><i>Powered by <a href="http://spm.sirkadirov.com/">SPM</a>.</i></p>
	</body>
</html>